### DataFrame의 인덱스 다루기 -2 
- 새로운 행 인덱스를 생성 및 적용
- 메서드: 명수명.reindex(새로운인덱스, fill_value=값)

In [1]:
# [1] 모듈 로딩
import pandas as pd

In [2]:
# [2] 데이터 준비
jumsu={'name': ['마징가', '태권V','원더우먼'],
       'kor': [98, 90, 80],
       'eng': [90,70,88],
       'math': [80, 70, 87]}

In [3]:
#[3] DataFrame형태로 저장
jumsu_DF= pd.DataFrame(jumsu)
jumsu_DF

   name  kor  eng  math
0   마징가   98   90    80
1   태권V   90   70    70
2  원더우먼   80   88    87

In [4]:
#[4] 행 인덱스를 새롭게 생성   ->기존 인덱스 안넣으면 안나옴
new_index= ['r0', 'r1', 'r2']
DF2= jumsu_DF.reindex(new_index)
DF2

   name  kor  eng  math
r0  NaN  NaN  NaN   NaN
r1  NaN  NaN  NaN   NaN
r2  NaN  NaN  NaN   NaN

In [7]:
#[4] 행 인덱스를 새롭게 생성         ->원하는 행 삭제 및 순서 변경 가능
new_index= [2,1, 'r0', 'r1', 'r2']
DF2= jumsu_DF.reindex(new_index)
DF2

    name   kor   eng  math
2   원더우먼  80.0  88.0  87.0
1    태권V  90.0  70.0  70.0
r0   NaN   NaN   NaN   NaN
r1   NaN   NaN   NaN   NaN
r2   NaN   NaN   NaN   NaN

In [8]:
#[5] 생성한 행 인덱스에 값 설정
DF3= jumsu_DF.reindex([0, 'r1', 'r0',2], fill_value=0)
DF3

    name  kor  eng  math
0    마징가   98   90    80
r1     0    0    0     0
r0     0    0    0     0
2   원더우먼   80   88    87